MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAR169/mcu.h
#define _SRCON0H_SR0H6_POSITION                  0x00000006
#define _SRCON0H_SR0H6_MASK                      0x00000040
#define _SRCON0H_SR0H6_LENGTH                    0x00000001

#define _SRCON0H_SR0H7_POSITION                  0x00000007
#define _SRCON0H_SR0H7_MASK                      0x00000080
#define _SRCON0H_SR0H7_LENGTH                    0x00000001

#define _SRCON0H_SR0H8_POSITION                  0x00000008
#define _SRCON0H_SR0H8_MASK                      0x00000100
#define _SRCON0H_SR0H8_LENGTH                    0x00000001

#define _SRCON0H_SR0H9_POSITION                  0x00000009
#define _SRCON0H_SR0H9_MASK                      0x00000200
#define _SRCON0H_SR0H9_LENGTH                    0x00000001

#define _SRCON0H_SR0H10_POSITION                 0x0000000A
#define _SRCON0H_SR0H10_MASK                     0x00000400
#define _SRCON0H_SR0H10_LENGTH                   0x00000001

#define _SRCON0H_SR0H11_POSITION                 0x0000000B
#define _SRCON0H_SR0H11_MASK                     0x00000800
#define _SRCON0H_SR0H11_LENGTH                   0x00000001

#define _SRCON0H_SR0H12_POSITION                 0x0000000C
#define _SRCON0H_SR0H12_MASK                     0x00001000
#define _SRCON0H_SR0H12_LENGTH                   0x00000001

#define _SRCON0H_SR0H13_POSITION                 0x0000000D
#define _SRCON0H_SR0H13_MASK                     0x00002000
#define _SRCON0H_SR0H13_LENGTH                   0x00000001

#define _SRCON0H_SR0H14_POSITION                 0x0000000E
#define _SRCON0H_SR0H14_MASK                     0x00004000
#define _SRCON0H_SR0H14_LENGTH                   0x00000001

#define _SRCON0H_SR0H15_POSITION                 0x0000000F
#define _SRCON0H_SR0H15_MASK                     0x00008000
#define _SRCON0H_SR0H15_LENGTH                   0x00000001

#define _SRCON1H_SR1H0_POSITION                  0x00000000
#define _SRCON1H_SR1H0_MASK                      0x00000001
#define _SRCON1H_SR1H0_LENGTH                    0x00000001

#define _SRCON1H_SR1H1_POSITION                  0x00000001
#define _SRCON1H_SR1H1_MASK                      0x00000002
#define _SRCON1H_SR1H1_LENGTH                    0x00000001

#define _SRCON1H_SR1H2_POSITION                  0x00000002
#define _SRCON1H_SR1H2_MASK                      0x00000004
#define _SRCON1H_SR1H2_LENGTH                    0x00000001

#define _SRCON1H_SR1H3_POSITION                  0x00000003
#define _SRCON1H_SR1H3_MASK                      0x00000008
#define _SRCON1H_SR1H3_LENGTH                    0x00000001

#define _SRCON1H_SR1H4_POSITION                  0x00000004
#define _SRCON1H_SR1H4_MASK                      0x00000010
#define _SRCON1H_SR1H4_LENGTH                    0x00000001

#define _SRCON1H_SR1H5_POSITION                  0x00000005
#define _SRCON1H_SR1H5_MASK                      0x00000020
#define _SRCON1H_SR1H5_LENGTH                    0x00000001

#define _SRCON1H_SR1H6_POSITION                  0x00000006
#define _SRCON1H_SR1H6_MASK                      0x00000040
#define _SRCON1H_SR1H6_LENGTH                    0x00000001

#define _SRCON1H_SR1H7_POSITION                  0x00000007
#define _SRCON1H_SR1H7_MASK                      0x00000080
#define _SRCON1H_SR1H7_LENGTH                    0x00000001

#define _SRCON1H_SR1H8_POSITION                  0x00000008
#define _SRCON1H_SR1H8_MASK                      0x00000100
#define _SRCON1H_SR1H8_LENGTH                    0x00000001

#define _SRCON1H_SR1H9_POSITION                  0x00000009
#define _SRCON1H_SR1H9_MASK                      0x00000200
#define _SRCON1H_SR1H9_LENGTH                    0x00000001

#define _SRCON1H_SR1H10_POSITION                 0x0000000A
#define _SRCON1H_SR1H10_MASK                     0x00000400
#define _SRCON1H_SR1H10_LENGTH                   0x00000001

#define _SRCON1H_SR1H11_POSITION                 0x0000000B
#define _SRCON1H_SR1H11_MASK                     0x00000800
#define _SRCON1H_SR1H11_LENGTH                   0x00000001

#define _SRCON1H_SR1H12_POSITION                 0x0000000C
#define _SRCON1H_SR1H12_MASK                     0x00001000
#define _SRCON1H_SR1H12_LENGTH                   0x00000001

#define _SRCON1H_SR1H13_POSITION                 0x0000000D
#define _SRCON1H_SR1H13_MASK                     0x00002000
#define _SRCON1H_SR1H13_LENGTH                   0x00000001

#define _SRCON1H_SR1H14_POSITION                 0x0000000E
#define _SRCON1H_SR1H14_MASK                     0x00004000
#define _SRCON1H_SR1H14_LENGTH                   0x00000001

#define _SRCON1H_SR1H15_POSITION                 0x0000000F
#define _SRCON1H_SR1H15_MASK                     0x00008000
#define _SRCON1H_SR1H15_LENGTH                   0x00000001

#define _ANSELJ_ANSJ2_POSITION                   0x00000002
#define _ANSELJ_ANSJ2_MASK                       0x00000004
#define _ANSELJ_ANSJ2_LENGTH                     0x00000001

#define _ANSELJ_w_POSITION                       0x00000000
#define _ANSELJ_w_MASK                           0xFFFFFFFF
#define _ANSELJ_w_LENGTH                         0x00000020

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

#define _TRISJ_TRISJ3_POSITION                   0x00000003
#define _TRISJ_TRISJ3_MASK                       0x00000008
#define _TRISJ_TRISJ3_LENGTH                     0x00000001

#define _TRISJ_TRISJ4_POSITION                   0x00000004
#define _TRISJ_TRISJ4_MASK                       0x00000010
#define _TRISJ_TRISJ4_LENGTH                     0x00000001

#define _TRISJ_TRISJ5_POSITION                   0x00000005
#define _TRISJ_TRISJ5_MASK                       0x00000020
#define _TRISJ_TRISJ5_LENGTH                     0x00000001

#define _TRISJ_TRISJ6_POSITION                   0x00000006
#define _TRISJ_TRISJ6_MASK                       0x00000040
#define _TRISJ_TRISJ6_LENGTH                     0x00000001

