MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAR169/mcu.h
#define _GLCDCURDATA26_PIXEL618_POSITION         0x00000014
#define _GLCDCURDATA26_PIXEL618_MASK             0x00F00000
#define _GLCDCURDATA26_PIXEL618_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL617_POSITION         0x00000018
#define _GLCDCURDATA26_PIXEL617_MASK             0x0F000000
#define _GLCDCURDATA26_PIXEL617_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL616_POSITION         0x0000001C
#define _GLCDCURDATA26_PIXEL616_MASK             0xF0000000
#define _GLCDCURDATA26_PIXEL616_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL631_POSITION         0x00000000
#define _GLCDCURDATA27_PIXEL631_MASK             0x0000000F
#define _GLCDCURDATA27_PIXEL631_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL630_POSITION         0x00000004
#define _GLCDCURDATA27_PIXEL630_MASK             0x000000F0
#define _GLCDCURDATA27_PIXEL630_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL629_POSITION         0x00000008
#define _GLCDCURDATA27_PIXEL629_MASK             0x00000F00
#define _GLCDCURDATA27_PIXEL629_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL628_POSITION         0x0000000C
#define _GLCDCURDATA27_PIXEL628_MASK             0x0000F000
#define _GLCDCURDATA27_PIXEL628_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL627_POSITION         0x00000010
#define _GLCDCURDATA27_PIXEL627_MASK             0x000F0000
#define _GLCDCURDATA27_PIXEL627_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL626_POSITION         0x00000014
#define _GLCDCURDATA27_PIXEL626_MASK             0x00F00000
#define _GLCDCURDATA27_PIXEL626_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL625_POSITION         0x00000018
#define _GLCDCURDATA27_PIXEL625_MASK             0x0F000000
#define _GLCDCURDATA27_PIXEL625_LENGTH           0x00000004

#define _GLCDCURDATA27_PIXEL624_POSITION         0x0000001C
#define _GLCDCURDATA27_PIXEL624_MASK             0xF0000000
#define _GLCDCURDATA27_PIXEL624_LENGTH           0x00000004

#define _GLCDCURDATA28_PIXEL77_POSITION          0x00000000
#define _GLCDCURDATA28_PIXEL77_MASK              0x0000000F
#define _GLCDCURDATA28_PIXEL77_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL76_POSITION          0x00000004
#define _GLCDCURDATA28_PIXEL76_MASK              0x000000F0
#define _GLCDCURDATA28_PIXEL76_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL75_POSITION          0x00000008
#define _GLCDCURDATA28_PIXEL75_MASK              0x00000F00
#define _GLCDCURDATA28_PIXEL75_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL74_POSITION          0x0000000C
#define _GLCDCURDATA28_PIXEL74_MASK              0x0000F000
#define _GLCDCURDATA28_PIXEL74_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL73_POSITION          0x00000010
#define _GLCDCURDATA28_PIXEL73_MASK              0x000F0000
#define _GLCDCURDATA28_PIXEL73_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL72_POSITION          0x00000014
#define _GLCDCURDATA28_PIXEL72_MASK              0x00F00000
#define _GLCDCURDATA28_PIXEL72_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL71_POSITION          0x00000018
#define _GLCDCURDATA28_PIXEL71_MASK              0x0F000000
#define _GLCDCURDATA28_PIXEL71_LENGTH            0x00000004

#define _GLCDCURDATA28_PIXEL70_POSITION          0x0000001C
#define _GLCDCURDATA28_PIXEL70_MASK              0xF0000000
#define _GLCDCURDATA28_PIXEL70_LENGTH            0x00000004

#define _GLCDCURDATA29_PIXEL715_POSITION         0x00000000
#define _GLCDCURDATA29_PIXEL715_MASK             0x0000000F
#define _GLCDCURDATA29_PIXEL715_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL714_POSITION         0x00000004
#define _GLCDCURDATA29_PIXEL714_MASK             0x000000F0
#define _GLCDCURDATA29_PIXEL714_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL713_POSITION         0x00000008
#define _GLCDCURDATA29_PIXEL713_MASK             0x00000F00
#define _GLCDCURDATA29_PIXEL713_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL712_POSITION         0x0000000C
#define _GLCDCURDATA29_PIXEL712_MASK             0x0000F000
#define _GLCDCURDATA29_PIXEL712_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL711_POSITION         0x00000010
#define _GLCDCURDATA29_PIXEL711_MASK             0x000F0000
#define _GLCDCURDATA29_PIXEL711_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL710_POSITION         0x00000014
#define _GLCDCURDATA29_PIXEL710_MASK             0x00F00000
#define _GLCDCURDATA29_PIXEL710_LENGTH           0x00000004

#define _GLCDCURDATA29_PIXEL79_POSITION          0x00000018
#define _GLCDCURDATA29_PIXEL79_MASK              0x0F000000
#define _GLCDCURDATA29_PIXEL79_LENGTH            0x00000004

#define _GLCDCURDATA29_PIXEL78_POSITION          0x0000001C
#define _GLCDCURDATA29_PIXEL78_MASK              0xF0000000
#define _GLCDCURDATA29_PIXEL78_LENGTH            0x00000004

#define _GLCDCURDATA30_PIXEL723_POSITION         0x00000000
#define _GLCDCURDATA30_PIXEL723_MASK             0x0000000F
#define _GLCDCURDATA30_PIXEL723_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL722_POSITION         0x00000004
#define _GLCDCURDATA30_PIXEL722_MASK             0x000000F0
#define _GLCDCURDATA30_PIXEL722_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL721_POSITION         0x00000008
#define _GLCDCURDATA30_PIXEL721_MASK             0x00000F00
#define _GLCDCURDATA30_PIXEL721_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL720_POSITION         0x0000000C
#define _GLCDCURDATA30_PIXEL720_MASK             0x0000F000
#define _GLCDCURDATA30_PIXEL720_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL719_POSITION         0x00000010
#define _GLCDCURDATA30_PIXEL719_MASK             0x000F0000
#define _GLCDCURDATA30_PIXEL719_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL718_POSITION         0x00000014
#define _GLCDCURDATA30_PIXEL718_MASK             0x00F00000
#define _GLCDCURDATA30_PIXEL718_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL717_POSITION         0x00000018
#define _GLCDCURDATA30_PIXEL717_MASK             0x0F000000
#define _GLCDCURDATA30_PIXEL717_LENGTH           0x00000004

#define _GLCDCURDATA30_PIXEL716_POSITION         0x0000001C
#define _GLCDCURDATA30_PIXEL716_MASK             0xF0000000
#define _GLCDCURDATA30_PIXEL716_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL731_POSITION         0x00000000
#define _GLCDCURDATA31_PIXEL731_MASK             0x0000000F
#define _GLCDCURDATA31_PIXEL731_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL730_POSITION         0x00000004
#define _GLCDCURDATA31_PIXEL730_MASK             0x000000F0
#define _GLCDCURDATA31_PIXEL730_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL729_POSITION         0x00000008
#define _GLCDCURDATA31_PIXEL729_MASK             0x00000F00
#define _GLCDCURDATA31_PIXEL729_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL728_POSITION         0x0000000C
#define _GLCDCURDATA31_PIXEL728_MASK             0x0000F000
#define _GLCDCURDATA31_PIXEL728_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL727_POSITION         0x00000010
#define _GLCDCURDATA31_PIXEL727_MASK             0x000F0000
#define _GLCDCURDATA31_PIXEL727_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL726_POSITION         0x00000014
#define _GLCDCURDATA31_PIXEL726_MASK             0x00F00000
#define _GLCDCURDATA31_PIXEL726_LENGTH           0x00000004

